//Переменные и изменяемость\\
/*
fn main() {
let x = 5;
println!("{}, x");
x = 6; // тут выходит ошибка так как попытались присвоить новое значение неизменяемой переменной х.
println!("{}, x");
}
*/ 
/*
fn main() {
    let mut x = 5; // тут мы применили mut таким образом мы можем теперь менять значение переменной
                   // так как она стала изменяемой.
    println!("{x}");
    x = 6;
    println!("{x}");
}
*/

//Константы\\
/*
Во-первых, нельзя использовать mut с константами. Константы не просто неизменяемы
по умолчанию — они неизменяемы всегда. Для объявления констант используется ключевое
слово const вместо let, а также тип значения должен быть указан в аннотации.
*/
/*
fn main() {
const THREE_HOURS_IN_SECONDS: u32 = 60 * 60 * 3;
}
*/

//Затенение (переменных)\\
/*
fn main() {
    let x = 5;
    let x = x +1; 
    {
        let x = x * 5;
        println!("{x}");
    }

    println!("{x}");
}
*/
/*
Сначала x = 5. Потом let x создаёт новую x на основе старой: 5 + 1 = 6. Затем внутри
блока {} третья let x снова создаёт новую x: 6 * 2 = 12. Когда блок заканчивается, эта
внутренняя x исчезает, и внешняя снова равна 6.
*/




